In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('raw_company_name.xlsx',sheet_name = 'Sheet1')

In [3]:
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 3355,Unnamed: 3356,Unnamed: 3357,Unnamed: 3358,Unnamed: 3359,Unnamed: 3360,Unnamed: 3361,Unnamed: 3362,Unnamed: 3363,Unnamed: 3364
0,Symbol Name,삼성전자,삼성전자우,SK하이닉스,LG화학,LG화학우,NAVER,삼성바이오로직스,카카오,현대차,...,중국원양자원,중국식품포장,차이나하오란,웨이포트,성융광전투자,완리,평산차업 KDR,네프로아이티,중국고섬,SBI모기지

In [4]:
df.loc[:,~df.T.duplicated()]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 3355,Unnamed: 3356,Unnamed: 3357,Unnamed: 3358,Unnamed: 3359,Unnamed: 3360,Unnamed: 3361,Unnamed: 3362,Unnamed: 3363,Unnamed: 3364
0,Symbol Name,삼성전자,삼성전자우,SK하이닉스,LG화학,LG화학우,NAVER,삼성바이오로직스,카카오,현대차,...,중국원양자원,중국식품포장,차이나하오란,웨이포트,성융광전투자,완리,평산차업 KDR,네프로아이티,중국고섬,SBI모기지

In [5]:
#중복되는 컬럼 찾기
for i in range(0,len(df.columns)):
    if df.T.duplicated()[i] == True:
        print(df.loc[0,"Unnamed: %d" %i])

삼성물산
SK
SK우
고려시멘트
하나은행
두산건설
알루코
핸디소프트
미래에셋증권
아이티센
국민은행
풀무원
신성이엔지
인터파크
경남은행
광주은행

In [6]:
df.T.duplicated()[1]

False

In [7]:
#중복되는 컬럼 제거
df1 = df.loc[:,~df.T.duplicated()]

In [8]:
for i in range(0,len(df1.columns)):
    if df1.T.duplicated()[i] == True:
        print(df1.loc[0,"Unnamed: %d" %i])